[{"data":1,"prerenderedAt":449},["ShallowReactive",2],{"content-query-zkkqNGanYX":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":9,"slidesUrl":10,"dateModified":11,"datePublished":11,"showOnArticles":12,"topics":13,"readingTime":17,"body":22,"_type":442,"_id":443,"_source":444,"_file":445,"_stem":446,"_extension":447,"sitemap":448},"/articles/rate-limiting","articles",false,"","Rate Limiting","Rate limiting runs within an application, rather than running on the web server itself. Typically, rate limiting is based on tracking the IP addresses that requests are coming from, and tracking how much time elapses between each request. The IP address is the main way an application identifies who or what is making the request. A rate limiting solution measures the amount of time between each request from each IP address, and also measures the number of requests within a specified timeframe. If there are too many requests from a single IP within the given timeframe, the rate limiting solution will not fulfill the IP address's requests for a certain amount of time.","https://github.com/AherRahul/portfolio-v1/blob/main/content/articles/rate-limiting.md","2024-05-24",true,[14,15,16],"system-design","aws","lld",{"text":18,"minutes":19,"time":20,"words":21},"8 min read",7.625,457500,1525,{"type":23,"children":24,"toc":422},"root",[25,33,38,43,50,63,68,80,86,91,98,110,115,121,126,131,137,155,167,173,184,190,195,201,206,211,216,222,227,263,269,274,280,285,290,296,301,307,312,317,323,335,340,350,360,370,380,390,400,404,409],{"type":26,"tag":27,"props":28,"children":29},"element","p",{},[30],{"type":31,"value":32},"text","Rate limiting runs within an application, rather than running on the web server itself. Typically, rate limiting is based on tracking the IP addresses that requests are coming from, and tracking how much time elapses between each request. The IP address is the main way an application identifies who or what is making the request.",{"type":26,"tag":27,"props":34,"children":35},{},[36],{"type":31,"value":37},"A rate limiting solution measures the amount of time between each request from each IP address, and also measures the number of requests within a specified timeframe. If there are too many requests from a single IP within the given timeframe, the rate limiting solution will not fulfill the IP address's requests for a certain amount of time.",{"type":26,"tag":27,"props":39,"children":40},{},[41],{"type":31,"value":42},"Essentially, a rate-limited application will say, \"Hey, slow down,\" to unique users that are making requests at a rapid rate. This is comparable to a police officer who pulls over a driver for exceeding the road's speed limit, or to a parent who tells their child not to eat so much candy in such a short span of time.",{"type":26,"tag":44,"props":45,"children":47},"h2",{"id":46},"what-is-rate-limiting",[48],{"type":31,"value":49},"What Is Rate Limiting?",{"type":26,"tag":27,"props":51,"children":52},{},[53,55,61],{"type":31,"value":54},"Rate limiting is a technique to limit network traffic to prevent users from exhausting system resources. Rate limiting makes it harder for malicious actors to overburden the system and cause attacks like ",{"type":26,"tag":56,"props":57,"children":58},"em",{},[59],{"type":31,"value":60},"Denial of Service (DoS)",{"type":31,"value":62},". This involves attackers flooding a target system with requests and consuming too much network capacity, storage, and memory.",{"type":26,"tag":27,"props":64,"children":65},{},[66],{"type":31,"value":67},"APIs that use rate limiting can throttle or temporarily block any client that tries to make too many API calls. It might slow down a throttled user’s requests for a specified time or deny them altogether. Rate limiting ensures that legitimate requests can reach the system and access information without impacting the overall application’s performance.",{"type":26,"tag":27,"props":69,"children":70},{},[71,73,78],{"type":31,"value":72},"This is part of a series of articles about ",{"type":26,"tag":56,"props":74,"children":75},{},[76],{"type":31,"value":77},"website security",{"type":31,"value":79},".",{"type":26,"tag":44,"props":81,"children":83},{"id":82},"why-is-rate-limiting-important",[84],{"type":31,"value":85},"Why Is Rate Limiting Important?",{"type":26,"tag":27,"props":87,"children":88},{},[89],{"type":31,"value":90},"Rate limiting is a crucial part of a modern cybersecurity strategy. It addresses several attack techniques that affect the incoming request rate.",{"type":26,"tag":92,"props":93,"children":95},"h3",{"id":94},"distributed-denial-of-service-ddos",[96],{"type":31,"value":97},"Distributed Denial of Service (DDoS)",{"type":26,"tag":27,"props":99,"children":100},{},[101,103,108],{"type":31,"value":102},"A ",{"type":26,"tag":56,"props":104,"children":105},{},[106],{"type":31,"value":107},"DDoS attack",{"type":31,"value":109}," attempts to overwhelm the target system with traffic, making it unavailable to legitimate users. Rate limiting mitigates DDoS threats by preventing any given traffic source from sending too many requests.",{"type":26,"tag":27,"props":111,"children":112},{},[113],{"type":31,"value":114},"However, DDoS attacks have unique challenges because they distribute requests among many different sources, sometimes millions of IP addresses. Distributing the attack allows each source to avoid exceeding the rate limit. The security solution should identify the requests from different locations as part of a single attack, treating them as a single source.",{"type":26,"tag":92,"props":116,"children":118},{"id":117},"credential-stuffing",[119],{"type":31,"value":120},"Credential Stuffing",{"type":26,"tag":27,"props":122,"children":123},{},[124],{"type":31,"value":125},"When attackers compromise databases containing user credentials, they can use these credentials to carry out further attacks. Usually, a bot stuffs stolen user credentials into a login form until a credential set works, allowing the bot to access the account.",{"type":26,"tag":27,"props":127,"children":128},{},[129],{"type":31,"value":130},"Bots are often highly successful because they can submit hundreds or thousands of credentials into a login form. Rate limiting helps identify credit stuffing and block the bots before they take over the account.",{"type":26,"tag":92,"props":132,"children":134},{"id":133},"brute-force",[135],{"type":31,"value":136},"Brute Force",{"type":26,"tag":27,"props":138,"children":139},{},[140,141,146,148,153],{"type":31,"value":102},{"type":26,"tag":56,"props":142,"children":143},{},[144],{"type":31,"value":145},"brute force attack",{"type":31,"value":147}," is similar to a ",{"type":26,"tag":56,"props":149,"children":150},{},[151],{"type":31,"value":152},"credential stuffing",{"type":31,"value":154}," attack but without a list of real user credentials. In this case, the bot systematically submits randomly generated credentials until a credential set works.",{"type":26,"tag":27,"props":156,"children":157},{},[158,160,165],{"type":31,"value":159},"A strongly secured ",{"type":26,"tag":56,"props":161,"children":162},{},[163],{"type":31,"value":164},"web application",{"type":31,"value":166}," sets password requirements that help mitigate brute force attacks, but large attacks can still consume many network resources. Rate limiting blocks these attacks to save system resources.",{"type":26,"tag":92,"props":168,"children":170},{"id":169},"data-scraping-and-theft",[171],{"type":31,"value":172},"Data Scraping and Theft",{"type":26,"tag":27,"props":174,"children":175},{},[176,178,183],{"type":31,"value":177},"Malicious actors often scrape target websites for information they can sell or use to undermine competitors. For example, an attacker might steal pricing information from an eCommerce company. A scraper bot can copy large amounts of data from target applications. Rate limiting detects and blocks ",{"type":26,"tag":56,"props":179,"children":180},{},[181],{"type":31,"value":182},"data scraping",{"type":31,"value":79},{"type":26,"tag":92,"props":185,"children":187},{"id":186},"inventory-denial",[188],{"type":31,"value":189},"Inventory Denial",{"type":26,"tag":27,"props":191,"children":192},{},[193],{"type":31,"value":194},"An inventory denial or inventory hoarding attack involves sending bots to a target web application, where they start transactions without finishing them. It hoards the inventory, making it unavailable to legitimate users.",{"type":26,"tag":44,"props":196,"children":198},{"id":197},"how-does-rate-limiting-work",[199],{"type":31,"value":200},"How Does Rate Limiting Work?",{"type":26,"tag":27,"props":202,"children":203},{},[204],{"type":31,"value":205},"Rate limiting works within applications, not in the web server. Rate limiting typically involves tracking the IP addresses where requests originate and identifying the time lapsed between requests. IP addresses are the application’s main way to identify who has made each request.",{"type":26,"tag":27,"props":207,"children":208},{},[209],{"type":31,"value":210},"Rate-limiting solutions work by measuring the elapsed time between every request from a given IP address and tracking the number of requests made in a set timeframe. If one IP address makes too many requests within the specified timeframe, the rate-limiting solution throttles the IP address and doesn’t fulfill its requests for the next timeframe.",{"type":26,"tag":27,"props":212,"children":213},{},[214],{"type":31,"value":215},"Rate-limited applications can tell individual users to slow down if they make requests too frequently. It’s akin to police officers pulling over drivers that exceed the speed limit or parents telling their children not to eat too much sugar in a short period.",{"type":26,"tag":44,"props":217,"children":219},{"id":218},"types-of-rate-limits",[220],{"type":31,"value":221},"Types of Rate Limits",{"type":26,"tag":27,"props":223,"children":224},{},[225],{"type":31,"value":226},"Administrators can define different parameters and methods and parameters when setting a rate limit. An organization’s chosen rate-limiting technique depends on the objective and the required level of restriction. Here are three main approaches to rate limiting that an organization might implement:",{"type":26,"tag":228,"props":229,"children":230},"ul",{},[231,243,253],{"type":26,"tag":232,"props":233,"children":234},"li",{},[235,241],{"type":26,"tag":236,"props":237,"children":238},"strong",{},[239],{"type":31,"value":240},"User rate limits",{"type":31,"value":242}," —this is the most popular rate-limiting method. It identifies the number of requests a given user makes, usually by tracking the user’s IP address or API key. Users that exceed the specified rate limit will trigger the application to deny any further requests until the rate-limited timeframe resets. Alternatively, users can contact the developers to increase the rate limit.",{"type":26,"tag":232,"props":244,"children":245},{},[246,251],{"type":26,"tag":236,"props":247,"children":248},{},[249],{"type":31,"value":250},"Geographic rate limits",{"type":31,"value":252}," —developers can further secure applications in a given geographic region by setting a rate limit for each specific region for a specified timeframe. For example, developers might predict that users in a given region will be less active between midnight and 9:00 am and define a lower rate limit for this timeframe. This approach helps prevent suspicious traffic and further reduces the risk of an attack.",{"type":26,"tag":232,"props":254,"children":255},{},[256,261],{"type":26,"tag":236,"props":257,"children":258},{},[259],{"type":31,"value":260},"Server rate limits",{"type":31,"value":262}," —developers can set rate limits at the server level if they define a specific server to handle parts of an application. This approach provides more flexibility, allowing the developers to increase the rate limit on commonly used servers while decreasing the traffic limit on less active servers.",{"type":26,"tag":44,"props":264,"children":266},{"id":265},"what-are-the-algorithms-used-for-rate-limiting",[267],{"type":31,"value":268},"What Are the Algorithms Used for Rate Limiting?",{"type":26,"tag":27,"props":270,"children":271},{},[272],{"type":31,"value":273},"There are several types of rate-limiting algorithms.",{"type":26,"tag":92,"props":275,"children":277},{"id":276},"fixed-window-rate-limiting",[278],{"type":31,"value":279},"Fixed-window Rate Limiting",{"type":26,"tag":27,"props":281,"children":282},{},[283],{"type":31,"value":284},"Fixed-window rate limiting algorithms restrict the number of requests allowed during a given timeframe (window). For instance, a server’s rate-limiting component might implement an algorithm that accepts up to 200 API requests per minute. There is a fixed timeframe starting from a specified time—the server will not serve more than 200 requests between 9:00 and 9:01, but the window will reset at 9:01, allowing another 200 requests until 9:02.",{"type":26,"tag":27,"props":286,"children":287},{},[288],{"type":31,"value":289},"Developers can implement a fixed-window algorithm at the server or user level. Implementing the algorithm at the user level will restrict each user to 200 requests per minute. In contrast, a server-level algorithm will restrict the server, meaning that all users combined can make up to 200 requests per minute.",{"type":26,"tag":92,"props":291,"children":293},{"id":292},"leaky-bucket-rate-limiting",[294],{"type":31,"value":295},"Leaky Bucket Rate Limiting",{"type":26,"tag":27,"props":297,"children":298},{},[299],{"type":31,"value":300},"Leaky bucket rate limiting algorithms differ from fixed-window algorithms because they don’t rely on specified timeframes. They focus on the fixed length of request queues without considering the time. The server will service requests on a first-come, first-serve basis. New requests join the back of the queue. The server will drop a new request if it arrives when the queue is full.",{"type":26,"tag":92,"props":302,"children":304},{"id":303},"sliding-window-rate-limiting",[305],{"type":31,"value":306},"Sliding-window Rate Limiting",{"type":26,"tag":27,"props":308,"children":309},{},[310],{"type":31,"value":311},"Sliding-window rate limiting algorithms are similar to fixed-window algorithms except for the starting point of each time window. With sliding-window rate limiting, the timeframe only starts when a user makes a new request, not a predetermined time. For instance, if the first request arrives at 9:00:24 am (and the rate limit is 200 per minute), the server will allow up to 200 requests until 9:01:24.",{"type":26,"tag":27,"props":313,"children":314},{},[315],{"type":31,"value":316},"Sliding-window algorithms help solve the issues affecting requests in fixed-window rate limiting. They also mitigate the starvation issue facing leaky bucket rate limiting by providing more flexibility.",{"type":26,"tag":92,"props":318,"children":320},{"id":319},"rate-limiting-with-imperva",[321],{"type":31,"value":322},"Rate Limiting with Imperva",{"type":26,"tag":27,"props":324,"children":325},{},[326,328,333],{"type":31,"value":327},"Imperva ",{"type":26,"tag":56,"props":329,"children":330},{},[331],{"type":31,"value":332},"Advanced Bot Protection",{"type":31,"value":334}," enforces rate limiting for websites, mobile apps and APIs, and can prevent business logic attacks from all access points. Gain seamless visibility and control over bot traffic to stop online fraud through account takeover or competitive price scraping.",{"type":26,"tag":27,"props":336,"children":337},{},[338],{"type":31,"value":339},"Beyond bot protection, Imperva provides comprehensive protection for applications, APIs, and microservices:",{"type":26,"tag":27,"props":341,"children":342},{},[343,348],{"type":26,"tag":56,"props":344,"children":345},{},[346],{"type":31,"value":347},"Web Application Firewall",{"type":31,"value":349}," – Prevent attacks with world-class analysis of web traffic to your applications.",{"type":26,"tag":27,"props":351,"children":352},{},[353,358],{"type":26,"tag":56,"props":354,"children":355},{},[356],{"type":31,"value":357},"Runtime Application Self-Protection (RASP)",{"type":31,"value":359}," – Real-time attack detection and prevention from your application runtime environment goes wherever your applications go. Stop external attacks and injections and reduce your vulnerability backlog.",{"type":26,"tag":27,"props":361,"children":362},{},[363,368],{"type":26,"tag":56,"props":364,"children":365},{},[366],{"type":31,"value":367},"API Security",{"type":31,"value":369}," – Automated API protection ensures your API endpoints are protected as they are published, shielding your applications from exploitation.",{"type":26,"tag":27,"props":371,"children":372},{},[373,378],{"type":26,"tag":56,"props":374,"children":375},{},[376],{"type":31,"value":377},"DDoS Protection",{"type":31,"value":379}," – Block attack traffic at the edge to ensure business continuity with guaranteed uptime and no performance impact. Secure your on premises or cloud-based assets – whether you’re hosted in AWS, Microsoft Azure, or Google Public Cloud.",{"type":26,"tag":27,"props":381,"children":382},{},[383,388],{"type":26,"tag":56,"props":384,"children":385},{},[386],{"type":31,"value":387},"Attack Analytics",{"type":31,"value":389}," – Ensures complete visibility with machine learning and domain expertise across the application security stack to reveal patterns in the noise and detect application attacks, enabling you to isolate and prevent attack campaigns.",{"type":26,"tag":27,"props":391,"children":392},{},[393,398],{"type":26,"tag":56,"props":394,"children":395},{},[396],{"type":31,"value":397},"Client-Side Protection",{"type":31,"value":399}," – Gain visibility and control over third-party JavaScript code to reduce the risk of supply chain fraud, prevent data breaches, and client-side attacks.",{"type":26,"tag":401,"props":402,"children":403},"hr",{},[],{"type":26,"tag":27,"props":405,"children":406},{},[407],{"type":31,"value":408},"Thank you so much for reading. If you found it valuable, consider subscribing for more such content every week. If you have any questions or suggestions, please email me your comments or feel free to improve it.",{"type":26,"tag":228,"props":410,"children":411},{},[412],{"type":26,"tag":232,"props":413,"children":414},{},[415],{"type":26,"tag":416,"props":417,"children":419},"a",{"href":418},"https://youtu.be/xpDnVSmNFX0?si=dwHLZjpSFvaGfRjD",[420],{"type":31,"value":421},"YouTube Resource (GKCS)",{"title":7,"searchDepth":423,"depth":423,"links":424},2,[425,426,434,435,436],{"id":46,"depth":423,"text":49},{"id":82,"depth":423,"text":85,"children":427},[428,430,431,432,433],{"id":94,"depth":429,"text":97},3,{"id":117,"depth":429,"text":120},{"id":133,"depth":429,"text":136},{"id":169,"depth":429,"text":172},{"id":186,"depth":429,"text":189},{"id":197,"depth":423,"text":200},{"id":218,"depth":423,"text":221},{"id":265,"depth":423,"text":268,"children":437},[438,439,440,441],{"id":276,"depth":429,"text":279},{"id":292,"depth":429,"text":295},{"id":303,"depth":429,"text":306},{"id":319,"depth":429,"text":322},"markdown","content:articles:rate-limiting.md","content","articles/rate-limiting.md","articles/rate-limiting","md",{"loc":4},1758003346235]