{"_path":"/articles/acid-transactions","_dir":"articles","_draft":false,"_partial":false,"_locale":"","title":"ACID TRANSACTIONS","description":"ACID transactions refer to a set of properties that are designed to ensure the reliability and consistency of database transactions. The term “ACID” stands for Atomicity, Consistency, Isolation, and Durability, which are the four key properties of an ACID transaction. Essentially, ACID transactions guarantee that database operations are executed correctly, and if there is any kind of failure, the database can recover to a previous state without losing any data or impacting the consistency of the data. In other words, ACID transactions provide a high level of assurance that database transactions will be processed reliably and that data will be stored accurately and consistently.","slidesUrl":"https://github.com/AherRahul/portfolio-v1/blob/main/content/articles/acid-transactions.md","dateModified":"2024-05-22","datePublished":"2024-05-22","showOnArticles":true,"topics":["system-design","aws","lld"],"readingTime":{"text":"10 min read","minutes":9.7,"time":582000,"words":1940},"body":{"type":"root","children":[{"type":"element","tag":"h2","props":{"id":"acid-transactions-defined"},"children":[{"type":"text","value":"Acid Transactions Defined"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"ACID transactions refer to a set of properties that are designed to ensure the reliability and consistency of database transactions. The term “ACID” stands for Atomicity, Consistency, Isolation, and Durability, which are the four key properties of an ACID transaction. Essentially, ACID transactions guarantee that database operations are executed correctly, and if there is any kind of failure, the database can recover to a previous state without losing any data or impacting the consistency of the data. In other words, ACID transactions provide a high level of assurance that database transactions will be processed reliably and that data will be stored accurately and consistently."}]},{"type":"element","tag":"h2","props":{"id":"understanding-acid-transactions"},"children":[{"type":"text","value":"Understanding acid transactions"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"An ACID transaction is a set of properties that ensure the reliability and consistency of a database transaction. Transactions are a series of operations that are completed as a single unit of work, using read and write operations to access data. Most databases provide transactional guarantees for operations that impact just one record. This section will explain the basic definitions of the characteristics involved in an ACID transaction."}]},{"type":"element","tag":"h3","props":{"id":"atomicity"},"children":[{"type":"text","value":"Atomicity"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Atomicity in ACID transactions guarantees that a transaction is treated as a single, indivisible unit of work. If any part of the transaction fails, the entire transaction must be rolled back, meaning that any changes made during the transaction are undone. This ensures that the database remains in a consistent state, regardless of any failures that may occur during the transaction."}]},{"type":"element","tag":"h3","props":{"id":"consistency"},"children":[{"type":"text","value":"Consistency"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Consistency ensures that the database remains in a valid state before and after the transaction. In other words, the database schema must satisfy all constraints and rules, and any transaction that violates these constraints must be rolled back to maintain the consistency of the database. This ensures that the database maintains its integrity and the data remains accurate and reliable."}]},{"type":"element","tag":"h3","props":{"id":"isolation"},"children":[{"type":"text","value":"Isolation"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"This property ensures that each transaction operates independently of other transactions, which means that a transaction’s effects should only become visible to other transactions after it has been committed. This property prevents interference and conflicts between concurrent transactions, and helps maintain the integrity and consistency of the database. It’s important to note that different levels of isolation can be configured for transactions, depending on the specific requirements of the application and the database system being used."}]},{"type":"element","tag":"h3","props":{"id":"durability"},"children":[{"type":"text","value":"Durability"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"This characteristic makes sure that, even in a system failure, the changes made to the database during a transaction are irreversible. Any changes made after a transaction is committed must persist, even if the system is destroyed or loses power."}]},{"type":"element","tag":"h2","props":{"id":"how-do-acid-transactions-work"},"children":[{"type":"text","value":"How do acid transactions work?"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"ACID transactions maintain data integrity by adhering to a set of steps. The steps described are a common way that databases implement ACID transactions, but there could be variations or differences in implementation depending on the specific database system being used."}]},{"type":"element","tag":"ol","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Begin Transaction: A BEGIN TRANSACTION statement declaration initiates a transaction and establishes a savepoint from which the transaction can be rolled back if necessary."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Execute operations: All operations within the transaction are executed one at a time. The database validates each operation to ensure it complies with the constraints and schema."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Commit or Rollback: Following the successful completion of all operations, the transaction is committed using the COMMIT statement. The transaction is rolled back to the savepoint established at the beginning of the transaction if any operation fails."}]}]},{"type":"element","tag":"h2","props":{"id":"example-of-an-acid-transaction-in-action"},"children":[{"type":"text","value":"Example of an acid transaction in action"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Consider a banking app where a user wishes to transfer funds from one account to another, where the operation’s transaction might look like this:"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"BEGIN TRANSACTION – An example of withdrawing money from the bank using a cheque, pay order, or through an ATM."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Deduct the transfer amount from the source account."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Add the transfer amount to the destination account."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"COMMIT – Updating the record of the transaction carried out by the customer."}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The transaction is rolled back, and the database is restored to its initial state if any of its operations fail, such as if the source account does not have enough funds."}]},{"type":"element","tag":"h2","props":{"id":"acid-transactions-use-cases"},"children":[{"type":"text","value":"Acid transactions use cases"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"ACID transactions are suitable for many use cases. Following are some examples:"}]},{"type":"element","tag":"h3","props":{"id":"banking"},"children":[{"type":"text","value":"Banking"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Banks use ACID transactions to ensure that payments and other financial transactions are handled accurately and securely. For example, when a customer withdraws money from an ATM, an ACID transaction is executed to update their account balance and record the transaction. The transaction is atomic, meaning it succeeds or fails, and the account balance remains constant."}]},{"type":"element","tag":"blockquote","props":{},"children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"For an outline of the right Redis tools to handle transactions, and learn how Redis Enterprise can help you scale your customer experience check out our whitepaper Ensure Customer Satisfaction with Redis"}]}]},{"type":"element","tag":"h3","props":{"id":"healthcare-systems"},"children":[{"type":"text","value":"Healthcare systems"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Healthcare systems use ACID transactions to help guarantee that patient records are updated accurately and that private medical data is protected. Electronic health records (EHRs) contain personal information about patients that must be accurate and consistent. For instance, an ACID transaction occurs when a doctor updates a patient’s medication in the EHR to ensure the data is updated atomically, consistently, and durably."}]},{"type":"element","tag":"h3","props":{"id":"e-commerce-applications"},"children":[{"type":"text","value":"E-commerce applications"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"E-commerce applications use ACID transactions to make sure that customer orders are processed correctly, and that inventory levels are updated correctly. For example, an ACID transaction is carried out when a customer purchases an item to update the inventory records and guarantee that the transaction is atomic, consistent, isolated, and durable."}]},{"type":"element","tag":"h2","props":{"id":"advantages-and-disadvantages-of-using-acid-transactions"},"children":[{"type":"text","value":"Advantages and disadvantages of using acid transactions"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Let’s compare the benefits and drawbacks of ACID transactions and identify their potential.  It’s worth noting that the disadvantages listed are not always inherent drawbacks of ACID transactions. They can vary depending on the specific implementation and the requirements of the application. For example, while overhead and scalability might be concerns in some scenarios, they may not be significant issues in others. Similarly, while deadlocks can be a problem in some cases, proper design and management of transactions can often mitigate or prevent them."}]},{"type":"element","tag":"table","props":{},"children":[{"type":"element","tag":"thead","props":{},"children":[{"type":"element","tag":"tr","props":{},"children":[{"type":"element","tag":"th","props":{"align":"left"},"children":[{"type":"text","value":"Advantages"}]},{"type":"element","tag":"th","props":{"align":"left"},"children":[{"type":"text","value":"Disadvantages"}]}]}]},{"type":"element","tag":"tbody","props":{},"children":[{"type":"element","tag":"tr","props":{},"children":[{"type":"element","tag":"td","props":{"align":"left"},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Data integrity"}]},{"type":"text","value":" – Even if a transaction fails, ACID transactions guarantee that the database will remain in a consistent state. It contributes to data reliability and integrity."}]},{"type":"element","tag":"td","props":{"align":"left"},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Overhead"}]},{"type":"text","value":" – The performance of databases is affected by the extra processing overhead required by ACID transactions."}]}]},{"type":"element","tag":"tr","props":{},"children":[{"type":"element","tag":"td","props":{"align":"left"},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Consistency"}]},{"type":"text","value":" - The validity of the database is ensured both before and after an ACID transaction. It contributes to database consistency."}]},{"type":"element","tag":"td","props":{"align":"left"},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Deadlocks"}]},{"type":"text","value":" – Multiple transactions waiting for each other to release resources can cause deadlocks. Deadlocks can be difficult to resolve and have an impact on database reading and retrieval performance."}]}]},{"type":"element","tag":"tr","props":{},"children":[{"type":"element","tag":"td","props":{"align":"left"},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Isolation"}]},{"type":"text","value":" – ACID transactions ensure that each transaction is independent of the others. It also contributes to preserving data integrity by preventing interference between concurrent transactions."}]},{"type":"element","tag":"td","props":{"align":"left"},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Scalability"}]},{"type":"text","value":" – ACID transactions can be difficult to implement in large-scale distributed systems that require performance and scalability."}]}]},{"type":"element","tag":"tr","props":{},"children":[{"type":"element","tag":"td","props":{"align":"left"},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Durability"}]},{"type":"text","value":" – ACID transactions ensure that database changes made during a transaction are irreversible, even in a system failure. It contributes to data reliability."}]},{"type":"element","tag":"td","props":{"align":"left"},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Similar data update"}]},{"type":"text","value":" - When several transactions are running concurrently, they might clash if they attempt to modify the same data at the same time. Thus,one transaction might need to wait for another transaction to finish before it can move forward, which would reduce system performance and increase latency."}]}]}]}]},{"type":"element","tag":"h2","props":{"id":"alternatives-to-acid-transactions"},"children":[{"type":"text","value":"Alternatives to acid transactions"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"ACID transactions provide several benefits for ensuring data reliability, consistency, isolation, and durability. However, they may not be the best fit for all applications. In such cases, there are various alternative transaction models and theorems available that can be considered instead of ACID. These include:"}]},{"type":"element","tag":"h3","props":{"id":"base-basically-available-soft-state-eventually-consistent"},"children":[{"type":"text","value":"BASE (Basically Available, Soft state, Eventually consistent)"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"BASE isn’t necessarily a replacement for ACID transactions, but rather an alternative model for handling distributed systems that cannot guarantee immediate consistency.  BASE emphasizes availability and partition tolerance more than consistency. This model trades off near-term consistency for long-term stability. Although it assumes that all data will eventually become consistent, it cannot guarantee this. This approach is appropriate for high-volume distributed systems because it provides greater scalability and availability. It is often used in conjunction with NoSQL databases, which prioritize scalability and availability over strict consistency requirements."}]},{"type":"element","tag":"h3","props":{"id":"cap-consistency-availability-partition-tolerance"},"children":[{"type":"text","value":"CAP (Consistency, Availability, Partition tolerance)"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The CAP theorem states that in a distributed system, it is impossible to guarantee all three of Consistency, Availability, and Partition tolerance. However, it does not suggest sacrificing consistency for availability and partition tolerance. In fact, the theorem poses a trade-off between consistency and partition tolerance. This means that in the event of a network partition, you must choose between consistency and partition tolerance. The CAP theorem is not truly an alternative transaction model but a theoretical framework for understanding the limitations of distributed systems. Transaction models, such as BASE, can be used in conjunction with the principles of CAP to design and implement distributed systems."}]},{"type":"element","tag":"h3","props":{"id":"nosql-databases"},"children":[{"type":"text","value":"NoSQL databases"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"NoSQL databases do not impose rigid consistency standards and prioritize performance and scalability over immediate consistency. They are often used in applications that require high throughput, and where data consistency is not critical. While relational databases ensure desirable ACID properties, NoSQL databases are more effective at handling large and complex data sets. Additionally, BASE properties can perform even better for a wide range of applications, although ACID is not always guaranteed in this case."}]},{"type":"element","tag":"h2","props":{"id":"acid-transactions-in-distributed-systems"},"children":[{"type":"text","value":"Acid transactions in distributed systems"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Distributed systems comprise numerous computers that interact with each other to deliver a single service. ACID transactions can be difficult to implement in a distributed system because they are made up of multiple nodes that are geographically dispersed and communicate over a network."}]},{"type":"element","tag":"h3","props":{"id":"challenges-of-implementing-acid-transactions-in-distributed-systems"},"children":[{"type":"text","value":"Challenges of implementing acid transactions in distributed systems"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Distributed systems consist of multiple computers that collaborate to provide a single service. ACID transactions can be challenging to implement in distributed systems because they comprise multiple nodes that are geographically dispersed and communicate over a network."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Challenges of implementing ACID transactions in distributed systems include:"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Network latency"}]},{"type":"text","value":": In distributed systems, network latency can impact the performance of ACID transactions. Longer transaction times and higher overhead can result from network communication delays."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Consistency"}]},{"type":"text","value":": Maintaining consistency across all nodes in a distributed system can be challenging. A distributed system’s nodes might store different versions of the same data, which could result in discrepancies."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Availability"}]},{"type":"text","value":": Keeping a distributed system available can be difficult. Nodes could fail, and it might be challenging to maintain the system’s responsiveness."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Scalability"}]},{"type":"text","value":": As the number of nodes in a distributed system increases, it becomes more difficult to maintain consistency and availability."}]},{"type":"element","tag":"h3","props":{"id":"solutions-for-maintaining-acid-properties-in-distributed-systems"},"children":[{"type":"text","value":"Solutions for maintaining acid properties in distributed systems"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"ACID transactions are difficult to maintain in distributed systems due to factors such as network latency, consistency, availability, and scalability. To address these challenges, several solutions have been developed, including:"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Two-phase commit"}]},{"type":"text","value":": This protocol ensures that all nodes in a distributed system agree to commit a transaction before it is committed, ensuring data consistency and agreement on the transaction’s outcome."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Multi-Version Concurrency Control (MVCC)"}]},{"type":"text","value":": This technique manages data concurrency in a distributed system by allowing each transaction to access the appropriate data version, enabling multiple versions of the same data to coexist."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Replication"}]},{"type":"text","value":": In a distributed system, replication involves keeping multiple copies of the same data on various nodes, reducing network latency and increasing availability."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Sharding"}]},{"type":"text","value":": This process involves dividing data across multiple nodes in a distributed system, improving performance and scalability but increasing the complexity of maintaining data consistency."}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"ACID transactions are a fundamental concept in database management, providing benefits such as data integrity, consistency, isolation, and durability. They ensure that the database remains in a consistent state even if the server fails. However, they do have limitations and challenges, such as overhead, deadlocks, and scalability problems in distributed systems."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Although ACID transactions provide strong consistency and reliability, they may not always be the best option for every use case. Organizations must carefully evaluate their unique needs and requirements to determine whether ACID transactions or alternative transaction models, such as BASE or CAP, are a better fit for their systems."}]},{"type":"element","tag":"hr","props":{},"children":[]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Thank you so much for reading. If you found it valuable, consider subscribing for more such content every week. If you have any questions or suggestions, please email me your comments or feel free to improve it."}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"a","props":{"href":"https://youtu.be/8UryASGBiR4?si=vjI2gCM3J0mhHMuU"},"children":[{"type":"text","value":"YouTube Resource (SCALER)"}]}]},{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"a","props":{"href":"http://ksat.me/a-plain-english-introduction-to-cap-theorem"},"children":[{"type":"text","value":"Blog Resource"}]}]}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[{"id":"acid-transactions-defined","depth":2,"text":"Acid Transactions Defined"},{"id":"understanding-acid-transactions","depth":2,"text":"Understanding acid transactions","children":[{"id":"atomicity","depth":3,"text":"Atomicity"},{"id":"consistency","depth":3,"text":"Consistency"},{"id":"isolation","depth":3,"text":"Isolation"},{"id":"durability","depth":3,"text":"Durability"}]},{"id":"how-do-acid-transactions-work","depth":2,"text":"How do acid transactions work?"},{"id":"example-of-an-acid-transaction-in-action","depth":2,"text":"Example of an acid transaction in action"},{"id":"acid-transactions-use-cases","depth":2,"text":"Acid transactions use cases","children":[{"id":"banking","depth":3,"text":"Banking"},{"id":"healthcare-systems","depth":3,"text":"Healthcare systems"},{"id":"e-commerce-applications","depth":3,"text":"E-commerce applications"}]},{"id":"advantages-and-disadvantages-of-using-acid-transactions","depth":2,"text":"Advantages and disadvantages of using acid transactions"},{"id":"alternatives-to-acid-transactions","depth":2,"text":"Alternatives to acid transactions","children":[{"id":"base-basically-available-soft-state-eventually-consistent","depth":3,"text":"BASE (Basically Available, Soft state, Eventually consistent)"},{"id":"cap-consistency-availability-partition-tolerance","depth":3,"text":"CAP (Consistency, Availability, Partition tolerance)"},{"id":"nosql-databases","depth":3,"text":"NoSQL databases"}]},{"id":"acid-transactions-in-distributed-systems","depth":2,"text":"Acid transactions in distributed systems","children":[{"id":"challenges-of-implementing-acid-transactions-in-distributed-systems","depth":3,"text":"Challenges of implementing acid transactions in distributed systems"},{"id":"solutions-for-maintaining-acid-properties-in-distributed-systems","depth":3,"text":"Solutions for maintaining acid properties in distributed systems"}]}]}},"_type":"markdown","_id":"content:articles:acid-transactions.md","_source":"content","_file":"articles/acid-transactions.md","_stem":"articles/acid-transactions","_extension":"md","sitemap":{"loc":"/articles/acid-transactions"}}